/*==============================================
¡á¡á¡áÀÚ¹ÙÀÇ °³¿ä ¹× Æ¯Â¡ ¡á¡á¡á

//º¯¼ö¿Í ÀÚ·áÇü
//º¯¼ö¿Í ÀÚ·áÇü ½Ç½À ¹× Å×½ºÆ® : char
===============================================*/


public class Test010
{
	public static void main(String[] args)
	{
		//ÁÖ¿ä º¯¼ö ¼±¾ğ
		char ch1, ch2, ch3; //char 2¹ÙÀÌÆ® ¹®ÀÚÇü


		int a; // ®G®G~~!!!!!!!!!!
		int a1;

		//¿¬»ê ¹× Ã³¸®(´ëÀÔ ¿¬»ê)
		ch1 = 'A';
		// ''´Â ¹®ÀÚ
		//"" ¹®ÀÚ¿­

		ch2 = '\n';
		//°³Çà ¹®ÀÚ , µû·Î°¡ ¾Æ´Ô.

		ch3 = '´ë';
		a = ch1;  
		//®G~~~~~~~~!!!!!!!!!!!!
		//¾Æ½ºÅ°¹®ÀÚ, ÀÚµ¿Çüº¯È¯

		a1 = (int)ch1; 
		//ÀÚµ¿Çüº¯È¯ À§¹è´Â ¾Æ´ÏÁö¸¸ ¾Ë·ÁÁÙ¶ó°í ¸í½ÃÀûÇüº¯È¯ °¡´É.


		

		// °á°ú Ãâ·Â
		System.out.println("ch1 : "+ ch1);
		System.out.println("ch2 : "+ ch2);
		System.out.println("ch3 : "+ ch3);
		System.out.println("a : " + a);
		System.out.println("a1 : " + a1);



	}

}

//½ÇÇà °á°ú
/*
ch1 : A
ch2 :

ch3 : ´ë
a : 65
a1 : 65
°è¼ÓÇÏ·Á¸é ¾Æ¹« Å°³ª ´©¸£½Ê½Ã¿À . . .

*/
