/*=====================================
		    ■■■ 배열 ■■■
======================================*/

// 배열의 배열(2차원 배열)


//○ 과제
//   배열의 배열(다차원 배열)을 활용하여
//   다음과 같은 데이터를 요소로 취하는 배열을 구성하고
//   그 결과를 출력하는 프로그램을 구현한다.

// 실행 예)
/*
A
C  B 
D  E  F
J  I  H  G 
K  L  M  N  O

계속하려면 아무 키나 누르십시오 . . .
*/

/*
[00] →  i == j 같으면 반복문 밖으로 나가자 ~ ! 근데 넣고 나가라!
[10] ← [11]  // 주목~!!!!!!!!!!!!
[20] → [21] → [22] → 
[30] ← [31] ← [32] ← [33] →
[40] → [41] → [42] → [43] → [44]

A B C D E F G H I J K L M N O

A  →1개
B C → 2개
D E F → 3개
G H I J → 4개
K L M N O → 5개
*/

public class Test096
{
	public static void main(String[] args)
	{
	}
}