/*==============================================
■■■연산자(Operator)■■■
// 비트 단위 연산자
=============================================*/

public class Test024
{
	public static void main(String[] args)
	{
		int a = 10, b= -10;

		System.out.printf("~a : %d%n", ~a);
		System.out.printf("~b : %d%n", ~b);



	}
}

/*
실행 결과
a : -11
~b : 9
계속하려면 아무 키나 누르십시오 . . .


*/


/*
a = 10 → 00001010
		
			 ↓~a (비트낫 a == 1의 보수, 비트열반전)

		  11110101 → -11 → check? → -11 + 11 = 0 확인

b = -10  바로 2진수 계산 ㄴㄴ 음수라
		
		00001010 → 이건 10
		11110101
	 +         1
	 --------------
	    11110110 == b

		~b == 00001001 == 9
				

*/