/*==============================================
■■■연산자(Operator)■■■
//조건 연산자 == 삼항 연산자

//사용자로부터 임의의 문자를 하나 입력받아
//대문자이면 소문자로 소문자이면 대문자로
//알파벳이 아닌 기타문자이면 그 문자 그대로 출력하는
//프로그램을 구현한다.

// 실행 예)
// 한 문자 입력 : A
// A → a
//계속하려면 아무 키나 누르세요....





// 한 문자 입력 : b
// b → B
//계속하려면 아무 키나 누르세요....




// 한 문자 입력 : 7
// 7 → 7
//계속하려면 아무 키나 누르세요....
=============================================*/

public class Test031
{
	public static void main(String[] args)
	{
	BufferedReader br = new BufferedReader(new InputStreamReader(System.in));

	//아스키코드 대문자 A : 65		B:66
	//			 소문자 a : 97		b:98
	//
	// 대문자 → 소문자 : 대문자 + 32
	// 소문자 → 대문자 : 소문자 - 32

	char ch; //사용자가 입력한 문자 담는 변수
	





	}
}