/* 클래스 이름은 Test001
 자바 프로그램의 클래스 이름은 첫 글자를 대문자로 시작.
 자바 프로그램 시작할 때 클래스(class)와 main함수를 
 기본적으로 입력.
 소스코드 저장 시, 클래스 이름과 동일한 파일 이름으로 저장
 단, 이 때 확장자는 .java로! */

public class Test001
{
	/* main() 이라는 이름을 가진 함수(메소드)
	-- 자바 인터프리터가 처음 찾는 함수(메소드) */

	public static void main(String[] args)
	{
		//
		//앞으로 우리가 당분간 코딩해야 하는 영역
		//메인메소드 안에서!
		//
		System.out.println("처음 작성한 프로그램");
		System.out.println("내이름은 홍은혜");

		// 이름() --> 이 이름을 가진 함수 (즉, 메소드) 호출한다는 뜻!
		// 호출하다: 여기 없는 사람을 부르는 것! 
		// 지 할일 하고 감.
		// 자바에서의 함수는 독립적으로 존재할 수 없다.
		// 클래스에 정의되는 형태로 만들어져야 한다.
		//그래서 자바의 함수를 메소드라고 부른다.
		

		//메소드 호출 구문: println();
		//함수, 즉 메소드는 기능, 동작, 행위
		//메소드가 정의가 되어야 호출을 할 수있고
		
		
		//공구창고.공구함.망치()
		//구급약통.먹는약상자.소화제()
		//구급약통.바르는약상자.마데카솔()
		//System.out.println()

		//System 도구상자 안의 out 도구상자 안에 
		//println()이라는 도구 즉, 메소드
		//System 클래스의 out 객체의 println() 메소드

		//pirntln()의 ln은 라인스킵:개행:줄바꿈.
		//print + ln
		//출력    개행

	}
}

// 실행 결과
/*
처음 작성한 프로그램
내이름은 홍은혜
계속하려면 아무 키나 누르십시오 . . .
*/
