/*=====================================
■■■실행 흐름의 컨트롤(제어문)■■■
======================================*/

// 반복문(for 문) 실습
//다중 for문(반복문의 중첩)을 활용한 별찍기 실습

//◎ 과제
//   다음과 같은 내용이 출력될 수 있도록
//   반복문의 중첩 구문을 작성하여 프로그램을 구현한다.

/* 실행 예)
*
**
***
****
*****
*/

//* 1개찍고 개행
//* 2개찍고 개행
//* 3개찍고 개행

// 웅웅~ 개행
// 쑝쑝!! 별 찍기

public class Test063
{
	public static void main(String[] args)
	{

		int i, j; 
		for (i=1;i<=5 ;i++ )
		{
			System.out.print
		}

/*
		int i, j; //-- 별찍기, 개행 루프변수

		for (j = 0;j <=5 ;j++ )
		{
			System.out.println();

			for (i = 1;i<=5 ;i++ )
			{
				System.out.print("*");
			}
		}

	}
}

/*
*****
*****
*****
*****
*****
*****계속하려면 아무 키나 누르십시오 . . .
*/