/*=====================================
		    ■■■ 배열 ■■■
======================================*/

//배열과 난수 처리(※ Random 클래스 활용)

//사용자로부터 임의의 정수를 입력받아
//그 정수의 갯수만큼 난수를 발생시켜 배열에 담고
//배열에 담겨있는 데이터들 중
//가장 큰 값과 가장 작은 값을 선택하여
//결과를 출력하는 프로그램을 구현한다.

//실행 예)
//발생시킬 난수의 갯수 입력 : 10
//(50 7 24 81 72 45 61 38 1 99 → 무작위로 발생한 정수들 ...)
//(int[] arr = {50 7 24 81 72 45 61 38 1 99} → 배열에 담아내기(배열 구성))
//가장 큰 값 : 99, 가장 작은 값 : 1
//계속하려면 .........


import java.util.Scanner;
import java.io.IOException;
import java.util.Random;


public class HomeWork8
{
	public static void main(String[] args)
	{


	}
}
