/*=====================================
		    ■■■ 배열 ■■■
======================================*/

// 배열의 배열(2차원 배열)

// 배열의 배열(다차원 배열)을 활용하여
// 다음과 같은 데이터를 요소로 취하는 배열을 구성하고
// 그 결과를 출력하는 프로그램을 구현한다.

// 실행 예)
/*
   1   2   3   4   10 ← [04]
   5   6   7   8   26 ← [14]
   9  10  11  12   42 ← [24]
  13  14  15  16   58 ← [34]
  28  32  36  40  136 ← [44]
  ↑  ↑  ↑  ↑   ↑   
 [40][41][42][43] [44]
 00   01  02  03   x = 0,1,2,3 y= 0   
 10   11  12  13   x = 0,1,2,3 y= 1
 20   21  22  23   x = 0,1,2,3 y= 2
 30   31  32  33   x = 0,1,2,3 y= 3
 x= 0123
 y=0  1    2   3
  

 
 
   

계속하려면 아무 키나 누르십시오 . . .
*/



public class Test093
{
	public static void main(String[] args)
	{

