/*=====================================
		    ■■■ 배열 ■■■
======================================*/

// 배열의 선언과 초기화
// 배열의 기본적 활용

// 사용자로부터 인원수를 입력 받고
// 입력받은 인원 수 만큼의 학생 이름과 전화번호를 입력받고
// 이를 이름 배열과 전화번호 배열로 구성하여 
// 결과를 출력할 수 있는 프로그램을 구현한다.

// 실행 예)
// 입력 처리할 학생 수 입력(명, 1 ~ 10) : 27
// 입력 처리할 학생 수 입력(명, 1 ~ 10) : -5
// 입력 처리할 학생 수 입력(명, 1 ~ 10) : 3
// 이름 전화번호 입력[1](공백 구분) : 박현수 010-1111-1111
// 이름 전화번호 입력[2](공백 구분) : 신시은 010-2222-2222
// 이름 전화번호 입력[3](공백 구분) : 오이삭 010-3333-3333

//---------------------------------
// 전체 학생 수 : 3명
//---------------------------------
//이름		       전화번호
//박현수	       010-1111-1111
//신시은		   010-2222-2222
//오이삭		   010-3333-3333
//---------------------------------
//계속하려면 ................

public class HomeWork4
{
	public static void main(String[] args)
	{
	}
}